{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"numericInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"numericInput"},"inbound_nodes":[]},{"name":"shiftInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"shiftInput"},"inbound_nodes":[]},{"name":"qualityInput","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"qualityInput"},"inbound_nodes":[]},{"name":"numericEmbedding","class_name":"Embedding","config":{"input_dim":7,"output_dim":2,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"numericEmbedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["numericInput",0,0,{}]]]},{"name":"shiftEmbedding","class_name":"Embedding","config":{"input_dim":3,"output_dim":2,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"shiftEmbedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["shiftInput",0,0,{}]]]},{"name":"qualityEmbedding","class_name":"Embedding","config":{"input_dim":15,"output_dim":4,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"qualityEmbedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["qualityInput",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["numericEmbedding",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["shiftEmbedding",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["qualityEmbedding",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}],["flatten_Flatten3",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":200,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"numericOutput","class_name":"Dense","config":{"units":7,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"numericOutput","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"shiftOutput","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shiftOutput","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"qualityOutput","class_name":"Dense","config":{"units":15,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"qualityOutput","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["numericInput",0,0],["shiftInput",0,0],["qualityInput",0,0]],"output_layers":[["numericOutput",0,0],["shiftOutput",0,0],["qualityOutput",0,0]]},"keras_version":"tfjs-layers 2.8.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"numericEmbedding/embeddings","shape":[7,2],"dtype":"float32"},{"name":"shiftEmbedding/embeddings","shape":[3,2],"dtype":"float32"},{"name":"qualityEmbedding/embeddings","shape":[15,4],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[8,200],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[200],"dtype":"float32"},{"name":"numericOutput/kernel","shape":[200,7],"dtype":"float32"},{"name":"numericOutput/bias","shape":[7],"dtype":"float32"},{"name":"shiftOutput/kernel","shape":[200,3],"dtype":"float32"},{"name":"shiftOutput/bias","shape":[3],"dtype":"float32"},{"name":"qualityOutput/kernel","shape":[200,15],"dtype":"float32"},{"name":"qualityOutput/bias","shape":[15],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.5","convertedBy":null}